%Kalman algorithm
%来着DR-CAN卡尔曼滤波教程评论区
Z = 3*(rand(100,1)*2-1)+50;%误差为+-3的测量值在(47,53)范围
X_hat = zeros(50,1);%估计值初始化
G_K   = zeros(50,1);%卡尔曼增益初始化
e     = zeros(50,1);%估计误差初始化
X_hat(1) = 40;%第一次估计值
e(1)     = 5;%第一次估计误差
G_K(1)   = 0;%第一次增益值
%%
for k = 2:100
    G_K(k) = e(k-1)/(e(k-1)+3);
    %第一步：卡尔曼增益G_K =第k-1次估计误差/(第k-1次估计误差+第k此测量误差)
    X_hat(k) = X_hat(k-1) + G_K(k) * ( Z(k)-X_hat(k-1) );%
    %第二步：第k次估计值=第k-1次估计值+G_K*(第k次测量值-第k-1次估计值)
    e(k) = (1-G_K(k))*e(k-1);
    %第三步；更新第k次估计误差e(k)=(1-卡尔曼增益)*k-1次估计误差
end
figure(1);
plot(Z)%画出测量值
hold on
plot(X_hat)%画出估计值
legend('测量值','估计值');


